brew "tig"
tap "caskroom/fonts"
tap "datawire/blackbird"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mveritym/mel"
tap "osx-cross/arm"

brew "ack"
brew "openssl"
brew "asdf"
brew "bash"
brew "ghc"
brew "cabal-install"
brew "python"
brew "ctags"
brew "curl"
brew "dfu-util"
brew "dnsmasq", restart_service: true
brew "docker-machine-driver-xhyve"
brew "exercism"
brew "fleetctl"
brew "fzf"
brew "glfw"
brew "gnupg", link: false
brew "go"
brew "gotags"
brew "graphviz"
brew "hopenpgp-tools"
brew "htop"
brew "httpie"
brew "jq"
brew "kubernetes-cli", link: false
brew "kubernetes-helm"
brew "libuv"
brew "macvim"
brew "mas"
brew "midnight-commander"
brew "mongodb", restart_service: true
brew "ncdu"
brew "neovim"
brew "nmap"
brew "node"
brew "ntfs-3g"
brew "pass"
brew "pgcli"
brew "pinentry-mac"
brew "pipenv"
brew "postgresql"
brew "ranger"
brew "scrcpy"
brew "socat"
brew "sphinx-doc"
brew "telnet"
brew "testdisk"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "tmux"
brew "watch"
brew "xhyve", args: ["HEAD"]
brew "ykpers", link: false
brew "ykman"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "datawire/blackbird/telepresence"
brew "heroku/brew/heroku"
brew "mveritym/mel/kubedecode"
brew "osx-cross/arm/arm-gcc-bin"

cask "osxfuse"
cask "1password-cli"
cask "android-platform-tools"
cask "calibre"
cask "font-inconsolata"
cask "font-iosevka"
cask "font-terminus"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "java8"
cask "keepassxc"
cask "private-eye"
cask "terminology"
cask "virtualbox"

mas "HyperDock", id: 449830122
mas "LastPass", id: 926036361
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
