tap "datawire/blackbird"
tap "golangci/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mveritym/mel"
tap "osx-cross/arm"

brew "ack"
brew "asdf"
brew "bash"
brew "ghc"
brew "cabal-install"
brew "ctags"
brew "curl"
brew "dfu-util"
brew "fd"
brew "fzf"
brew "git"
brew "gnupg", link: false
brew "go"
brew "gotags"
brew "hopenpgp-tools"
brew "htop"
brew "httpie"
brew "jq"
brew "libuv"
brew "mas"
brew "midnight-commander"
brew "ncdu"
brew "neovim"
brew "nmap"
brew "ntfs-3g"
brew "pass"
brew "pgcli"
brew "pinentry-mac"
brew "pipenv"
brew "ranger"
brew "socat"
brew "telnet"
brew "testdisk"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "vim"
brew "watch"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

cask "osxfuse"
cask "1password-cli"
cask "appcleaner"
cask "calibre"
cask "coconutbattery"
cask "docker"
cask "firefox"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-terminus"
cask "gpg-suite"
cask "iterm2"
cask "private-eye"
cask "spotify"
cask "sublime-text"
cask "viscosity"

mas "HyperDock", id: 449830122
mas "The Unarchiver", id: 425424353
